# ####################################################################

#  Created by Genus(TM) Synthesis Solution 19.14-s108_1 on Sat May 03 14:52:18 CDT 2025

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1fF
set_units -time 1ps

# Set the current design
current_design MSDAP

create_clock -name "Dclk" -period 1302000.0 -waveform {0.0 651000.0} [get_ports Dclk]
create_clock -name "Sclk" -period 33333.3 -waveform {0.0 16666.65} [get_ports Sclk]
set_load -pin_load 1.0 [get_ports InReady]
set_load -pin_load 1.0 [get_ports OutReady]
set_load -pin_load 1.0 [get_ports OutputL]
set_load -pin_load 1.0 [get_ports OutputR]
set_clock_groups -name "clock_groups_Dclk_to_others" -asynchronous -group [get_clocks Dclk]
set_clock_groups -name "clock_groups_Sclk_to_others" -asynchronous -group [get_clocks Sclk]
set_clock_gating_check -setup 0.0 
set_dont_use true [get_lib_cells asap7sc7p5t_SIMPLE_RVT_SS_nldm_201020/AND4x1_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_SIMPLE_RVT_SS_nldm_201020/FAx1_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_SIMPLE_RVT_SS_nldm_201020/OR2x6_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_SIMPLE_RVT_SS_nldm_201020/XNOR2x1_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_SIMPLE_RVT_SS_nldm_201020/XOR2x2_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_SIMPLE_LVT_SS_nldm_201020/AND4x1_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_SIMPLE_LVT_SS_nldm_201020/FAx1_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_SIMPLE_LVT_SS_nldm_201020/OR2x6_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_SIMPLE_LVT_SS_nldm_201020/XNOR2x1_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_SIMPLE_LVT_SS_nldm_201020/XOR2x2_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_SIMPLE_SLVT_SS_nldm_201020/AND4x1_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_SIMPLE_SLVT_SS_nldm_201020/FAx1_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_SIMPLE_SLVT_SS_nldm_201020/OR2x6_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_SIMPLE_SLVT_SS_nldm_201020/XNOR2x1_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_SIMPLE_SLVT_SS_nldm_201020/XOR2x2_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_SIMPLE_SRAM_SS_nldm_201020/AND4x1_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_SIMPLE_SRAM_SS_nldm_201020/FAx1_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_SIMPLE_SRAM_SS_nldm_201020/OR2x6_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_SIMPLE_SRAM_SS_nldm_201020/XNOR2x1_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_SIMPLE_SRAM_SS_nldm_201020/XOR2x2_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_AO_RVT_SS_nldm_201020/A2O1A1O1Ixp25_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_AO_RVT_SS_nldm_201020/AO21x1_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_AO_RVT_SS_nldm_201020/AO21x2_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_AO_RVT_SS_nldm_201020/AOI211xp5_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_AO_RVT_SS_nldm_201020/AOI32xp33_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_AO_LVT_SS_nldm_201020/A2O1A1O1Ixp25_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_AO_LVT_SS_nldm_201020/AO21x1_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_AO_LVT_SS_nldm_201020/AO21x2_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_AO_LVT_SS_nldm_201020/AOI211xp5_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_AO_LVT_SS_nldm_201020/AOI32xp33_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_AO_SLVT_SS_nldm_201020/A2O1A1O1Ixp25_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_AO_SLVT_SS_nldm_201020/AO21x1_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_AO_SLVT_SS_nldm_201020/AO21x2_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_AO_SLVT_SS_nldm_201020/AOI211xp5_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_AO_SLVT_SS_nldm_201020/AOI32xp33_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_AO_SRAM_SS_nldm_201020/A2O1A1O1Ixp25_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_AO_SRAM_SS_nldm_201020/AO21x1_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_AO_SRAM_SS_nldm_201020/AO21x2_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_AO_SRAM_SS_nldm_201020/AOI211xp5_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_AO_SRAM_SS_nldm_201020/AOI32xp33_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_RVT_SS_nldm_201020/OAI21x1_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_RVT_SS_nldm_201020/OAI221xp5_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_RVT_SS_nldm_201020/OAI31xp33_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_RVT_SS_nldm_201020/OAI31xp67_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_RVT_SS_nldm_201020/OAI322xp33_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_RVT_SS_nldm_201020/OAI32xp33_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_RVT_SS_nldm_201020/OAI33xp33_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_LVT_SS_nldm_201020/OAI21x1_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_LVT_SS_nldm_201020/OAI221xp5_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_LVT_SS_nldm_201020/OAI31xp33_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_LVT_SS_nldm_201020/OAI31xp67_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_LVT_SS_nldm_201020/OAI322xp33_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_LVT_SS_nldm_201020/OAI32xp33_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_LVT_SS_nldm_201020/OAI33xp33_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_SLVT_SS_nldm_201020/OAI21x1_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_SLVT_SS_nldm_201020/OAI221xp5_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_SLVT_SS_nldm_201020/OAI31xp33_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_SLVT_SS_nldm_201020/OAI31xp67_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_SLVT_SS_nldm_201020/OAI322xp33_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_SLVT_SS_nldm_201020/OAI32xp33_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_SLVT_SS_nldm_201020/OAI33xp33_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_SRAM_SS_nldm_201020/OAI21x1_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_SRAM_SS_nldm_201020/OAI221xp5_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_SRAM_SS_nldm_201020/OAI31xp33_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_SRAM_SS_nldm_201020/OAI31xp67_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_SRAM_SS_nldm_201020/OAI322xp33_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_SRAM_SS_nldm_201020/OAI32xp33_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_SRAM_SS_nldm_201020/OAI33xp33_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_RVT_SS_nldm_201020/ICGx2p67DC_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_RVT_SS_nldm_201020/ICGx4DC_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_RVT_SS_nldm_201020/ICGx5p33DC_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_RVT_SS_nldm_201020/ICGx6p67DC_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_RVT_SS_nldm_201020/ICGx8DC_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_RVT_SS_nldm_201020/SDFLx1_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_RVT_SS_nldm_201020/SDFLx2_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_RVT_SS_nldm_201020/SDFLx3_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_LVT_SS_nldm_201020/ICGx2p67DC_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_LVT_SS_nldm_201020/ICGx4DC_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_LVT_SS_nldm_201020/ICGx5p33DC_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_LVT_SS_nldm_201020/ICGx6p67DC_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_LVT_SS_nldm_201020/ICGx8DC_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_LVT_SS_nldm_201020/SDFLx1_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_LVT_SS_nldm_201020/SDFLx2_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_LVT_SS_nldm_201020/SDFLx3_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_SLVT_SS_nldm_201020/ICGx2p67DC_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_SLVT_SS_nldm_201020/ICGx4DC_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_SLVT_SS_nldm_201020/ICGx5p33DC_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_SLVT_SS_nldm_201020/ICGx6p67DC_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_SLVT_SS_nldm_201020/ICGx8DC_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_SLVT_SS_nldm_201020/SDFLx1_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_SLVT_SS_nldm_201020/SDFLx2_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_SLVT_SS_nldm_201020/SDFLx3_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_SRAM_SS_nldm_201020/ICGx2p67DC_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_SRAM_SS_nldm_201020/ICGx4DC_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_SRAM_SS_nldm_201020/ICGx5p33DC_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_SRAM_SS_nldm_201020/ICGx6p67DC_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_SRAM_SS_nldm_201020/ICGx8DC_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_SRAM_SS_nldm_201020/SDFLx1_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_SRAM_SS_nldm_201020/SDFLx2_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_SRAM_SS_nldm_201020/SDFLx3_ASAP7_75t_SRAM]
set_clock_uncertainty -setup 100.0 [get_clocks Dclk]
set_clock_uncertainty -hold 100.0 [get_clocks Dclk]
set_clock_uncertainty -setup 100.0 [get_clocks Sclk]
set_clock_uncertainty -hold 100.0 [get_clocks Sclk]
